StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE8.h
    struct {
      __IOM uint32_t PRES_REG3  : 16;           /*!< [15..0] Clock Prescaller for Fast                                         */
      __IOM uint32_t PRES_REG1  : 16;           /*!< [31..16] Clock Prescaller for Slow                                        */
    } HSE0_CHK0_b;
  } ;
  
  union {
    __IOM uint32_t HSE0_CHK1;                   /*!< (@ 0x00000058) Clock Checker Register                                     */
    
    struct {
      __IOM uint32_t PRES_REG3  : 16;           /*!< [15..0] Clock Prescaller for Fast                                         */
      __IOM uint32_t PRES_REG1  : 16;           /*!< [31..16] Clock Prescaller for Slow                                        */
    } HSE0_CHK1_b;
  } ;
  
  union {
    __IOM uint32_t HSE0_CHK2;                   /*!< (@ 0x0000005C) Clock Checker Register                                     */
    
    struct {
      __IOM uint32_t BASE_REG0  : 8;            /*!< [7..0] Min factor for SLOWEST                                             */
      __IOM uint32_t BASE_REG1  : 8;            /*!< [15..8] Min factor for SLOW                                               */
      __IOM uint32_t BASE_REG2  : 8;            /*!< [23..16] Max factor for FAST                                              */
      __IOM uint32_t BASE_REG3  : 8;            /*!< [31..24] Max factor for FASTEST                                           */
    } HSE0_CHK2_b;
  } ;
  
  union {
    __IOM uint32_t HSE0_STAT;                   /*!< (@ 0x00000060) Clock Status Register                                      */
    
    struct {
      __IOM uint32_t MAX_CLK_SHIFT_REG0 : 8;    /*!< [7..0] Max factor detected for SLOW                                       */
      __IOM uint32_t MAX_CLK_SHIFT_REG1 : 8;    /*!< [15..8] Max factor detected for FAST                                      */
      __IOM uint32_t EVENT0     : 1;            /*!< [16..16] Event SLOWEST                                                    */
      __IOM uint32_t EVENT1     : 1;            /*!< [17..17] Event SLOW                                                       */
      __IOM uint32_t EVENT2     : 1;            /*!< [18..18] Event FAST                                                       */
      __IOM uint32_t EVENT3     : 1;            /*!< [19..19] Event FASTEST                                                    */
      __IOM uint32_t READY      : 1;            /*!< [20..20] Clock Ready                                                      */
    } HSE0_STAT_b;
  } ;
  
  union {
    __IOM uint32_t HSE1_CLK;                    /*!< (@ 0x00000064) Clock Contorl Register                                     */
    
    struct {
      __IM  uint32_t            : 16;
      __IOM uint32_t EN_CHK_EVENT0 : 1;         /*!< [16..16] Go to HSI on lose active clock                                   */
      __IOM uint32_t EN_CHK_EVENT1 : 1;         /*!< [17..17] Go to HSI if active clock is low                                 */
      __IOM uint32_t EN_CHK_EVENT2 : 1;         /*!< [18..18] Go to HSI if active clock is High                                */
      __IOM uint32_t EN_CHK_EVENT3 : 1;         /*!< [19..19] Go to HSI if active clock is Highest                             */
      __IOM uint32_t EN_CHK     : 1;            /*!< [20..20] Clock Checker enable                                             */
      __IOM uint32_t CLR_CHK_SHIFT_REG0 : 1;    /*!< [21..21] Clear Min Freq level                                             */
      __IOM uint32_t CLR_CHK_SHIFT_REG1 : 1;    /*!< [22..22] Clear Max Freq level                                             */
      __IOM uint32_t CLR_CHK_EVENT0 : 1;        /*!< [23..23] Clear no freq event                                              */
      __IOM uint32_t CLR_CHK_EVENT1 : 1;        /*!< [24..24] Clear low freq event                                             */
      __IOM uint32_t CLR_CHK_EVENT2 : 1;        /*!< [25..25] Clear high freq event                                            */
      __IOM uint32_t CLR_CHK_EVENT3 : 1;        /*!< [26..26] Clear highest freq event                                         */
      __IOM uint32_t HSE_ON     : 1;            /*!< [27..27] Generator Enable                                                 */
      __IOM uint32_t HSE_BYP    : 1;            /*!< [28..28] ByPass Mode                                                      */
      __IOM uint32_t FILTER_EN  : 1;            /*!< [29..29] Filter Enable                                                    */
    } HSE1_CLK_b;
  } ;
  
  union {
    __IOM uint32_t HSE1_CHK0;                   /*!< (@ 0x00000068) Clock Checker Register                                     */
    
    struct {
      __IOM uint32_t PRES_REG3  : 16;           /*!< [15..0] Clock Prescaller for Fast                                         */
      __IOM uint32_t PRES_REG1  : 16;           /*!< [31..16] Clock Prescaller for Slow                                        */
    } HSE1_CHK0_b;
  } ;
  
  union {
    __IOM uint32_t HSE1_CHK1;                   /*!< (@ 0x0000006C) Clock Checker Register                                     */
    
    struct {
      __IOM uint32_t PRES_REG3  : 16;           /*!< [15..0] Clock Prescaller for Fast                                         */
      __IOM uint32_t PRES_REG1  : 16;           /*!< [31..16] Clock Prescaller for Slow                                        */
    } HSE1_CHK1_b;
  } ;
  
  union {
    __IOM uint32_t HSE1_CHK2;                   /*!< (@ 0x00000070) Clock Checker Register                                     */
    
    struct {
      __IOM uint32_t BASE_REG0  : 8;            /*!< [7..0] Min factor for SLOWEST                                             */
      __IOM uint32_t BASE_REG1  : 8;            /*!< [15..8] Min factor for SLOW                                               */
      __IOM uint32_t BASE_REG2  : 8;            /*!< [23..16] Max factor for FAST                                              */
      __IOM uint32_t BASE_REG3  : 8;            /*!< [31..24] Max factor for FASTEST                                           */
    } HSE1_CHK2_b;
  } ;
  
  union {
    __IOM uint32_t HSE1_STAT;                   /*!< (@ 0x00000074) Clock Status Register                                      */
    
