StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE8.h
#define MDR_RST_CLOCK_HSE1_STAT_READY_Msk (0x100000UL)              /*!< MDR_RST_CLOCK HSE1_STAT: READY (Bitfield-Mask: 0x01)  */
/* =======================================================  PLL0_CLK  ======================================================== */
#define MDR_RST_CLOCK_PLL0_CLK_PLL_Q_Pos  (0UL)                     /*!< MDR_RST_CLOCK PLL0_CLK: PLL_Q (Bit 0)                 */
#define MDR_RST_CLOCK_PLL0_CLK_PLL_Q_Msk  (0xfUL)                   /*!< MDR_RST_CLOCK PLL0_CLK: PLL_Q (Bitfield-Mask: 0x0f)   */
#define MDR_RST_CLOCK_PLL0_CLK_DV_Pos     (4UL)                     /*!< MDR_RST_CLOCK PLL0_CLK: DV (Bit 4)                    */
#define MDR_RST_CLOCK_PLL0_CLK_DV_Msk     (0x10UL)                  /*!< MDR_RST_CLOCK PLL0_CLK: DV (Bitfield-Mask: 0x01)      */
#define MDR_RST_CLOCK_PLL0_CLK_PLL_N_Pos  (8UL)                     /*!< MDR_RST_CLOCK PLL0_CLK: PLL_N (Bit 8)                 */
#define MDR_RST_CLOCK_PLL0_CLK_PLL_N_Msk  (0x7f00UL)                /*!< MDR_RST_CLOCK PLL0_CLK: PLL_N (Bitfield-Mask: 0x7f)   */
#define MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT0_Pos (16UL)             /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK_EVENT0 (Bit 16)        */
#define MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT0_Msk (0x10000UL)        /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK_EVENT0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT1_Pos (17UL)             /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK_EVENT1 (Bit 17)        */
#define MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT1_Msk (0x20000UL)        /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK_EVENT1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT2_Pos (18UL)             /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK_EVENT2 (Bit 18)        */
#define MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT2_Msk (0x40000UL)        /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK_EVENT2 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT3_Pos (19UL)             /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK_EVENT3 (Bit 19)        */
#define MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT3_Msk (0x80000UL)        /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK_EVENT3 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL0_CLK_EN_CHK_Pos (20UL)                    /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK (Bit 20)               */
#define MDR_RST_CLOCK_PLL0_CLK_EN_CHK_Msk (0x100000UL)              /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLOCK_PLL0_CLK_CLR_CHK_SHIFT_REG0_Pos (21UL)        /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_SHIFT_REG0 (Bit 21)   */
#define MDR_RST_CLOCK_PLL0_CLK_CLR_CHK_SHIFT_REG0_Msk (0x200000UL)  /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_SHIFT_REG0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL0_CLK_CLR_CHK_SHIFT_REG1_Pos (22UL)        /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_SHIFT_REG1 (Bit 22)   */
#define MDR_RST_CLOCK_PLL0_CLK_CLR_CHK_SHIFT_REG1_Msk (0x400000UL)  /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_SHIFT_REG1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL0_CLK_CLR_CHK_EVENT0_Pos (23UL)            /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_EVENT0 (Bit 23)       */
#define MDR_RST_CLOCK_PLL0_CLK_CLR_CHK_EVENT0_Msk (0x800000UL)      /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_EVENT0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL0_CLK_CLR_CHK_EVENT1_Pos (24UL)            /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_EVENT1 (Bit 24)       */
#define MDR_RST_CLOCK_PLL0_CLK_CLR_CHK_EVENT1_Msk (0x1000000UL)     /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_EVENT1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL0_CLK_CLR_CHK_EVENT2_Pos (25UL)            /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_EVENT2 (Bit 25)       */
#define MDR_RST_CLOCK_PLL0_CLK_CLR_CHK_EVENT2_Msk (0x2000000UL)     /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_EVENT2 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL0_CLK_CLR_CHK_EVENT3_Pos (26UL)            /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_EVENT3 (Bit 26)       */
#define MDR_RST_CLOCK_PLL0_CLK_CLR_CHK_EVENT3_Msk (0x4000000UL)     /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_EVENT3 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL0_CLK_PLL_ON_Pos (27UL)                    /*!< MDR_RST_CLOCK PLL0_CLK: PLL_ON (Bit 27)               */
#define MDR_RST_CLOCK_PLL0_CLK_PLL_ON_Msk (0x8000000UL)             /*!< MDR_RST_CLOCK PLL0_CLK: PLL_ON (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLOCK_PLL0_CLK_PLL_RLD_Pos (28UL)                   /*!< MDR_RST_CLOCK PLL0_CLK: PLL_RLD (Bit 28)              */
#define MDR_RST_CLOCK_PLL0_CLK_PLL_RLD_Msk (0x10000000UL)           /*!< MDR_RST_CLOCK PLL0_CLK: PLL_RLD (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL0_CLK_SELECT_Pos (29UL)                    /*!< MDR_RST_CLOCK PLL0_CLK: SELECT (Bit 29)               */
#define MDR_RST_CLOCK_PLL0_CLK_SELECT_Msk (0xe0000000UL)            /*!< MDR_RST_CLOCK PLL0_CLK: SELECT (Bitfield-Mask: 0x07)  */
/* =======================================================  PLL0_CHK0  ======================================================= */
#define MDR_RST_CLOCK_PLL0_CHK0_PRES_REG3_Pos (0UL)                 /*!< MDR_RST_CLOCK PLL0_CHK0: PRES_REG3 (Bit 0)            */
#define MDR_RST_CLOCK_PLL0_CHK0_PRES_REG3_Msk (0xffffUL)            /*!< MDR_RST_CLOCK PLL0_CHK0: PRES_REG3 (Bitfield-Mask: 0xffff) */
#define MDR_RST_CLOCK_PLL0_CHK0_PRES_REG1_Pos (16UL)                /*!< MDR_RST_CLOCK PLL0_CHK0: PRES_REG1 (Bit 16)           */
#define MDR_RST_CLOCK_PLL0_CHK0_PRES_REG1_Msk (0xffff0000UL)        /*!< MDR_RST_CLOCK PLL0_CHK0: PRES_REG1 (Bitfield-Mask: 0xffff) */
/* =======================================================  PLL0_CHK1  ======================================================= */
#define MDR_RST_CLOCK_PLL0_CHK1_PRES_REG3_Pos (0UL)                 /*!< MDR_RST_CLOCK PLL0_CHK1: PRES_REG3 (Bit 0)            */
#define MDR_RST_CLOCK_PLL0_CHK1_PRES_REG3_Msk (0xffffUL)            /*!< MDR_RST_CLOCK PLL0_CHK1: PRES_REG3 (Bitfield-Mask: 0xffff) */
#define MDR_RST_CLOCK_PLL0_CHK1_PRES_REG1_Pos (16UL)                /*!< MDR_RST_CLOCK PLL0_CHK1: PRES_REG1 (Bit 16)           */
#define MDR_RST_CLOCK_PLL0_CHK1_PRES_REG1_Msk (0xffff0000UL)        /*!< MDR_RST_CLOCK PLL0_CHK1: PRES_REG1 (Bitfield-Mask: 0xffff) */
/* =======================================================  PLL0_CHK2  ======================================================= */
#define MDR_RST_CLOCK_PLL0_CHK2_BASE_REG0_Pos (0UL)                 /*!< MDR_RST_CLOCK PLL0_CHK2: BASE_REG0 (Bit 0)            */
#define MDR_RST_CLOCK_PLL0_CHK2_BASE_REG0_Msk (0xffUL)              /*!< MDR_RST_CLOCK PLL0_CHK2: BASE_REG0 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_PLL0_CHK2_BASE_REG1_Pos (8UL)                 /*!< MDR_RST_CLOCK PLL0_CHK2: BASE_REG1 (Bit 8)            */
#define MDR_RST_CLOCK_PLL0_CHK2_BASE_REG1_Msk (0xff00UL)            /*!< MDR_RST_CLOCK PLL0_CHK2: BASE_REG1 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_PLL0_CHK2_BASE_REG2_Pos (16UL)                /*!< MDR_RST_CLOCK PLL0_CHK2: BASE_REG2 (Bit 16)           */
#define MDR_RST_CLOCK_PLL0_CHK2_BASE_REG2_Msk (0xff0000UL)          /*!< MDR_RST_CLOCK PLL0_CHK2: BASE_REG2 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_PLL0_CHK2_BASE_REG3_Pos (24UL)                /*!< MDR_RST_CLOCK PLL0_CHK2: BASE_REG3 (Bit 24)           */
#define MDR_RST_CLOCK_PLL0_CHK2_BASE_REG3_Msk (0xff000000UL)        /*!< MDR_RST_CLOCK PLL0_CHK2: BASE_REG3 (Bitfield-Mask: 0xff) */
/* =======================================================  PLL0_STAT  ======================================================= */
#define MDR_RST_CLOCK_PLL0_STAT_MAX_CLK_SHIFT_REG0_Pos (0UL)        /*!< MDR_RST_CLOCK PLL0_STAT: MAX_CLK_SHIFT_REG0 (Bit 0)   */
#define MDR_RST_CLOCK_PLL0_STAT_MAX_CLK_SHIFT_REG0_Msk (0xffUL)     /*!< MDR_RST_CLOCK PLL0_STAT: MAX_CLK_SHIFT_REG0 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_PLL0_STAT_MAX_CLK_SHIFT_REG1_Pos (8UL)        /*!< MDR_RST_CLOCK PLL0_STAT: MAX_CLK_SHIFT_REG1 (Bit 8)   */
#define MDR_RST_CLOCK_PLL0_STAT_MAX_CLK_SHIFT_REG1_Msk (0xff00UL)   /*!< MDR_RST_CLOCK PLL0_STAT: MAX_CLK_SHIFT_REG1 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_PLL0_STAT_EVENT0_Pos (16UL)                   /*!< MDR_RST_CLOCK PLL0_STAT: EVENT0 (Bit 16)              */
#define MDR_RST_CLOCK_PLL0_STAT_EVENT0_Msk (0x10000UL)              /*!< MDR_RST_CLOCK PLL0_STAT: EVENT0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL0_STAT_EVENT1_Pos (17UL)                   /*!< MDR_RST_CLOCK PLL0_STAT: EVENT1 (Bit 17)              */
#define MDR_RST_CLOCK_PLL0_STAT_EVENT1_Msk (0x20000UL)              /*!< MDR_RST_CLOCK PLL0_STAT: EVENT1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL0_STAT_EVENT2_Pos (18UL)                   /*!< MDR_RST_CLOCK PLL0_STAT: EVENT2 (Bit 18)              */
#define MDR_RST_CLOCK_PLL0_STAT_EVENT2_Msk (0x40000UL)              /*!< MDR_RST_CLOCK PLL0_STAT: EVENT2 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL0_STAT_EVENT3_Pos (19UL)                   /*!< MDR_RST_CLOCK PLL0_STAT: EVENT3 (Bit 19)              */
#define MDR_RST_CLOCK_PLL0_STAT_EVENT3_Msk (0x80000UL)              /*!< MDR_RST_CLOCK PLL0_STAT: EVENT3 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL0_STAT_READY_Pos (20UL)                    /*!< MDR_RST_CLOCK PLL0_STAT: READY (Bit 20)               */
#define MDR_RST_CLOCK_PLL0_STAT_READY_Msk (0x100000UL)              /*!< MDR_RST_CLOCK PLL0_STAT: READY (Bitfield-Mask: 0x01)  */
/* =======================================================  PLL1_CLK  ======================================================== */
#define MDR_RST_CLOCK_PLL1_CLK_PLL_Q_Pos  (0UL)                     /*!< MDR_RST_CLOCK PLL1_CLK: PLL_Q (Bit 0)                 */
#define MDR_RST_CLOCK_PLL1_CLK_PLL_Q_Msk  (0xfUL)                   /*!< MDR_RST_CLOCK PLL1_CLK: PLL_Q (Bitfield-Mask: 0x0f)   */
#define MDR_RST_CLOCK_PLL1_CLK_DV_Pos     (4UL)                     /*!< MDR_RST_CLOCK PLL1_CLK: DV (Bit 4)                    */
#define MDR_RST_CLOCK_PLL1_CLK_DV_Msk     (0x10UL)                  /*!< MDR_RST_CLOCK PLL1_CLK: DV (Bitfield-Mask: 0x01)      */
#define MDR_RST_CLOCK_PLL1_CLK_PLL_N_Pos  (8UL)                     /*!< MDR_RST_CLOCK PLL1_CLK: PLL_N (Bit 8)                 */
#define MDR_RST_CLOCK_PLL1_CLK_PLL_N_Msk  (0x7f00UL)                /*!< MDR_RST_CLOCK PLL1_CLK: PLL_N (Bitfield-Mask: 0x7f)   */
#define MDR_RST_CLOCK_PLL1_CLK_EN_CHK_EVENT0_Pos (16UL)             /*!< MDR_RST_CLOCK PLL1_CLK: EN_CHK_EVENT0 (Bit 16)        */
#define MDR_RST_CLOCK_PLL1_CLK_EN_CHK_EVENT0_Msk (0x10000UL)        /*!< MDR_RST_CLOCK PLL1_CLK: EN_CHK_EVENT0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL1_CLK_EN_CHK_EVENT1_Pos (17UL)             /*!< MDR_RST_CLOCK PLL1_CLK: EN_CHK_EVENT1 (Bit 17)        */
#define MDR_RST_CLOCK_PLL1_CLK_EN_CHK_EVENT1_Msk (0x20000UL)        /*!< MDR_RST_CLOCK PLL1_CLK: EN_CHK_EVENT1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL1_CLK_EN_CHK_EVENT2_Pos (18UL)             /*!< MDR_RST_CLOCK PLL1_CLK: EN_CHK_EVENT2 (Bit 18)        */
#define MDR_RST_CLOCK_PLL1_CLK_EN_CHK_EVENT2_Msk (0x40000UL)        /*!< MDR_RST_CLOCK PLL1_CLK: EN_CHK_EVENT2 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL1_CLK_EN_CHK_EVENT3_Pos (19UL)             /*!< MDR_RST_CLOCK PLL1_CLK: EN_CHK_EVENT3 (Bit 19)        */
#define MDR_RST_CLOCK_PLL1_CLK_EN_CHK_EVENT3_Msk (0x80000UL)        /*!< MDR_RST_CLOCK PLL1_CLK: EN_CHK_EVENT3 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL1_CLK_EN_CHK_Pos (20UL)                    /*!< MDR_RST_CLOCK PLL1_CLK: EN_CHK (Bit 20)               */
#define MDR_RST_CLOCK_PLL1_CLK_EN_CHK_Msk (0x100000UL)              /*!< MDR_RST_CLOCK PLL1_CLK: EN_CHK (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLOCK_PLL1_CLK_CLR_CHK_SHIFT_REG0_Pos (21UL)        /*!< MDR_RST_CLOCK PLL1_CLK: CLR_CHK_SHIFT_REG0 (Bit 21)   */
#define MDR_RST_CLOCK_PLL1_CLK_CLR_CHK_SHIFT_REG0_Msk (0x200000UL)  /*!< MDR_RST_CLOCK PLL1_CLK: CLR_CHK_SHIFT_REG0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL1_CLK_CLR_CHK_SHIFT_REG1_Pos (22UL)        /*!< MDR_RST_CLOCK PLL1_CLK: CLR_CHK_SHIFT_REG1 (Bit 22)   */
#define MDR_RST_CLOCK_PLL1_CLK_CLR_CHK_SHIFT_REG1_Msk (0x400000UL)  /*!< MDR_RST_CLOCK PLL1_CLK: CLR_CHK_SHIFT_REG1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL1_CLK_CLR_CHK_EVENT0_Pos (23UL)            /*!< MDR_RST_CLOCK PLL1_CLK: CLR_CHK_EVENT0 (Bit 23)       */
#define MDR_RST_CLOCK_PLL1_CLK_CLR_CHK_EVENT0_Msk (0x800000UL)      /*!< MDR_RST_CLOCK PLL1_CLK: CLR_CHK_EVENT0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL1_CLK_CLR_CHK_EVENT1_Pos (24UL)            /*!< MDR_RST_CLOCK PLL1_CLK: CLR_CHK_EVENT1 (Bit 24)       */
#define MDR_RST_CLOCK_PLL1_CLK_CLR_CHK_EVENT1_Msk (0x1000000UL)     /*!< MDR_RST_CLOCK PLL1_CLK: CLR_CHK_EVENT1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL1_CLK_CLR_CHK_EVENT2_Pos (25UL)            /*!< MDR_RST_CLOCK PLL1_CLK: CLR_CHK_EVENT2 (Bit 25)       */
#define MDR_RST_CLOCK_PLL1_CLK_CLR_CHK_EVENT2_Msk (0x2000000UL)     /*!< MDR_RST_CLOCK PLL1_CLK: CLR_CHK_EVENT2 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL1_CLK_CLR_CHK_EVENT3_Pos (26UL)            /*!< MDR_RST_CLOCK PLL1_CLK: CLR_CHK_EVENT3 (Bit 26)       */
#define MDR_RST_CLOCK_PLL1_CLK_CLR_CHK_EVENT3_Msk (0x4000000UL)     /*!< MDR_RST_CLOCK PLL1_CLK: CLR_CHK_EVENT3 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL1_CLK_PLL_ON_Pos (27UL)                    /*!< MDR_RST_CLOCK PLL1_CLK: PLL_ON (Bit 27)               */
#define MDR_RST_CLOCK_PLL1_CLK_PLL_ON_Msk (0x8000000UL)             /*!< MDR_RST_CLOCK PLL1_CLK: PLL_ON (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLOCK_PLL1_CLK_PLL_RLD_Pos (28UL)                   /*!< MDR_RST_CLOCK PLL1_CLK: PLL_RLD (Bit 28)              */
#define MDR_RST_CLOCK_PLL1_CLK_PLL_RLD_Msk (0x10000000UL)           /*!< MDR_RST_CLOCK PLL1_CLK: PLL_RLD (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL1_CLK_SELECT_Pos (29UL)                    /*!< MDR_RST_CLOCK PLL1_CLK: SELECT (Bit 29)               */
#define MDR_RST_CLOCK_PLL1_CLK_SELECT_Msk (0xe0000000UL)            /*!< MDR_RST_CLOCK PLL1_CLK: SELECT (Bitfield-Mask: 0x07)  */
/* =======================================================  PLL1_CHK0  ======================================================= */
#define MDR_RST_CLOCK_PLL1_CHK0_PRES_REG3_Pos (0UL)                 /*!< MDR_RST_CLOCK PLL1_CHK0: PRES_REG3 (Bit 0)            */
#define MDR_RST_CLOCK_PLL1_CHK0_PRES_REG3_Msk (0xffffUL)            /*!< MDR_RST_CLOCK PLL1_CHK0: PRES_REG3 (Bitfield-Mask: 0xffff) */
#define MDR_RST_CLOCK_PLL1_CHK0_PRES_REG1_Pos (16UL)                /*!< MDR_RST_CLOCK PLL1_CHK0: PRES_REG1 (Bit 16)           */
#define MDR_RST_CLOCK_PLL1_CHK0_PRES_REG1_Msk (0xffff0000UL)        /*!< MDR_RST_CLOCK PLL1_CHK0: PRES_REG1 (Bitfield-Mask: 0xffff) */
/* =======================================================  PLL1_CHK1  ======================================================= */
#define MDR_RST_CLOCK_PLL1_CHK1_PRES_REG3_Pos (0UL)                 /*!< MDR_RST_CLOCK PLL1_CHK1: PRES_REG3 (Bit 0)            */
#define MDR_RST_CLOCK_PLL1_CHK1_PRES_REG3_Msk (0xffffUL)            /*!< MDR_RST_CLOCK PLL1_CHK1: PRES_REG3 (Bitfield-Mask: 0xffff) */
#define MDR_RST_CLOCK_PLL1_CHK1_PRES_REG1_Pos (16UL)                /*!< MDR_RST_CLOCK PLL1_CHK1: PRES_REG1 (Bit 16)           */
#define MDR_RST_CLOCK_PLL1_CHK1_PRES_REG1_Msk (0xffff0000UL)        /*!< MDR_RST_CLOCK PLL1_CHK1: PRES_REG1 (Bitfield-Mask: 0xffff) */
/* =======================================================  PLL1_CHK2  ======================================================= */
#define MDR_RST_CLOCK_PLL1_CHK2_BASE_REG0_Pos (0UL)                 /*!< MDR_RST_CLOCK PLL1_CHK2: BASE_REG0 (Bit 0)            */
#define MDR_RST_CLOCK_PLL1_CHK2_BASE_REG0_Msk (0xffUL)              /*!< MDR_RST_CLOCK PLL1_CHK2: BASE_REG0 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_PLL1_CHK2_BASE_REG1_Pos (8UL)                 /*!< MDR_RST_CLOCK PLL1_CHK2: BASE_REG1 (Bit 8)            */
#define MDR_RST_CLOCK_PLL1_CHK2_BASE_REG1_Msk (0xff00UL)            /*!< MDR_RST_CLOCK PLL1_CHK2: BASE_REG1 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_PLL1_CHK2_BASE_REG2_Pos (16UL)                /*!< MDR_RST_CLOCK PLL1_CHK2: BASE_REG2 (Bit 16)           */
#define MDR_RST_CLOCK_PLL1_CHK2_BASE_REG2_Msk (0xff0000UL)          /*!< MDR_RST_CLOCK PLL1_CHK2: BASE_REG2 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_PLL1_CHK2_BASE_REG3_Pos (24UL)                /*!< MDR_RST_CLOCK PLL1_CHK2: BASE_REG3 (Bit 24)           */
#define MDR_RST_CLOCK_PLL1_CHK2_BASE_REG3_Msk (0xff000000UL)        /*!< MDR_RST_CLOCK PLL1_CHK2: BASE_REG3 (Bitfield-Mask: 0xff) */
/* =======================================================  PLL1_STAT  ======================================================= */
#define MDR_RST_CLOCK_PLL1_STAT_MAX_CLK_SHIFT_REG0_Pos (0UL)        /*!< MDR_RST_CLOCK PLL1_STAT: MAX_CLK_SHIFT_REG0 (Bit 0)   */
#define MDR_RST_CLOCK_PLL1_STAT_MAX_CLK_SHIFT_REG0_Msk (0xffUL)     /*!< MDR_RST_CLOCK PLL1_STAT: MAX_CLK_SHIFT_REG0 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_PLL1_STAT_MAX_CLK_SHIFT_REG1_Pos (8UL)        /*!< MDR_RST_CLOCK PLL1_STAT: MAX_CLK_SHIFT_REG1 (Bit 8)   */
#define MDR_RST_CLOCK_PLL1_STAT_MAX_CLK_SHIFT_REG1_Msk (0xff00UL)   /*!< MDR_RST_CLOCK PLL1_STAT: MAX_CLK_SHIFT_REG1 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_PLL1_STAT_EVENT0_Pos (16UL)                   /*!< MDR_RST_CLOCK PLL1_STAT: EVENT0 (Bit 16)              */
#define MDR_RST_CLOCK_PLL1_STAT_EVENT0_Msk (0x10000UL)              /*!< MDR_RST_CLOCK PLL1_STAT: EVENT0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL1_STAT_EVENT1_Pos (17UL)                   /*!< MDR_RST_CLOCK PLL1_STAT: EVENT1 (Bit 17)              */
#define MDR_RST_CLOCK_PLL1_STAT_EVENT1_Msk (0x20000UL)              /*!< MDR_RST_CLOCK PLL1_STAT: EVENT1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL1_STAT_EVENT2_Pos (18UL)                   /*!< MDR_RST_CLOCK PLL1_STAT: EVENT2 (Bit 18)              */
#define MDR_RST_CLOCK_PLL1_STAT_EVENT2_Msk (0x40000UL)              /*!< MDR_RST_CLOCK PLL1_STAT: EVENT2 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL1_STAT_EVENT3_Pos (19UL)                   /*!< MDR_RST_CLOCK PLL1_STAT: EVENT3 (Bit 19)              */
#define MDR_RST_CLOCK_PLL1_STAT_EVENT3_Msk (0x80000UL)              /*!< MDR_RST_CLOCK PLL1_STAT: EVENT3 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL1_STAT_READY_Pos (20UL)                    /*!< MDR_RST_CLOCK PLL1_STAT: READY (Bit 20)               */
#define MDR_RST_CLOCK_PLL1_STAT_READY_Msk (0x100000UL)              /*!< MDR_RST_CLOCK PLL1_STAT: READY (Bitfield-Mask: 0x01)  */
/* =======================================================  PLL2_CLK  ======================================================== */
#define MDR_RST_CLOCK_PLL2_CLK_PLL_Q_Pos  (0UL)                     /*!< MDR_RST_CLOCK PLL2_CLK: PLL_Q (Bit 0)                 */
#define MDR_RST_CLOCK_PLL2_CLK_PLL_Q_Msk  (0xfUL)                   /*!< MDR_RST_CLOCK PLL2_CLK: PLL_Q (Bitfield-Mask: 0x0f)   */
#define MDR_RST_CLOCK_PLL2_CLK_DV_Pos     (4UL)                     /*!< MDR_RST_CLOCK PLL2_CLK: DV (Bit 4)                    */
#define MDR_RST_CLOCK_PLL2_CLK_DV_Msk     (0x10UL)                  /*!< MDR_RST_CLOCK PLL2_CLK: DV (Bitfield-Mask: 0x01)      */
#define MDR_RST_CLOCK_PLL2_CLK_PLL_N_Pos  (8UL)                     /*!< MDR_RST_CLOCK PLL2_CLK: PLL_N (Bit 8)                 */
#define MDR_RST_CLOCK_PLL2_CLK_PLL_N_Msk  (0x7f00UL)                /*!< MDR_RST_CLOCK PLL2_CLK: PLL_N (Bitfield-Mask: 0x7f)   */
#define MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT0_Pos (16UL)             /*!< MDR_RST_CLOCK PLL2_CLK: EN_CHK_EVENT0 (Bit 16)        */
#define MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT0_Msk (0x10000UL)        /*!< MDR_RST_CLOCK PLL2_CLK: EN_CHK_EVENT0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT1_Pos (17UL)             /*!< MDR_RST_CLOCK PLL2_CLK: EN_CHK_EVENT1 (Bit 17)        */
#define MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT1_Msk (0x20000UL)        /*!< MDR_RST_CLOCK PLL2_CLK: EN_CHK_EVENT1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT2_Pos (18UL)             /*!< MDR_RST_CLOCK PLL2_CLK: EN_CHK_EVENT2 (Bit 18)        */
#define MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT2_Msk (0x40000UL)        /*!< MDR_RST_CLOCK PLL2_CLK: EN_CHK_EVENT2 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT3_Pos (19UL)             /*!< MDR_RST_CLOCK PLL2_CLK: EN_CHK_EVENT3 (Bit 19)        */
#define MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT3_Msk (0x80000UL)        /*!< MDR_RST_CLOCK PLL2_CLK: EN_CHK_EVENT3 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_CLK_EN_CHK_Pos (20UL)                    /*!< MDR_RST_CLOCK PLL2_CLK: EN_CHK (Bit 20)               */
#define MDR_RST_CLOCK_PLL2_CLK_EN_CHK_Msk (0x100000UL)              /*!< MDR_RST_CLOCK PLL2_CLK: EN_CHK (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_SHIFT_REG0_Pos (21UL)        /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_SHIFT_REG0 (Bit 21)   */
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_SHIFT_REG0_Msk (0x200000UL)  /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_SHIFT_REG0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_SHIFT_REG1_Pos (22UL)        /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_SHIFT_REG1 (Bit 22)   */
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_SHIFT_REG1_Msk (0x400000UL)  /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_SHIFT_REG1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT0_Pos (23UL)            /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_EVENT0 (Bit 23)       */
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT0_Msk (0x800000UL)      /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_EVENT0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT1_Pos (24UL)            /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_EVENT1 (Bit 24)       */
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT1_Msk (0x1000000UL)     /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_EVENT1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT2_Pos (25UL)            /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_EVENT2 (Bit 25)       */
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT2_Msk (0x2000000UL)     /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_EVENT2 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT3_Pos (26UL)            /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_EVENT3 (Bit 26)       */
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT3_Msk (0x4000000UL)     /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_EVENT3 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_CLK_PLL_ON_Pos (27UL)                    /*!< MDR_RST_CLOCK PLL2_CLK: PLL_ON (Bit 27)               */
#define MDR_RST_CLOCK_PLL2_CLK_PLL_ON_Msk (0x8000000UL)             /*!< MDR_RST_CLOCK PLL2_CLK: PLL_ON (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLOCK_PLL2_CLK_PLL_RLD_Pos (28UL)                   /*!< MDR_RST_CLOCK PLL2_CLK: PLL_RLD (Bit 28)              */
#define MDR_RST_CLOCK_PLL2_CLK_PLL_RLD_Msk (0x10000000UL)           /*!< MDR_RST_CLOCK PLL2_CLK: PLL_RLD (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_CLK_SELECT_Pos (29UL)                    /*!< MDR_RST_CLOCK PLL2_CLK: SELECT (Bit 29)               */
#define MDR_RST_CLOCK_PLL2_CLK_SELECT_Msk (0xe0000000UL)            /*!< MDR_RST_CLOCK PLL2_CLK: SELECT (Bitfield-Mask: 0x07)  */
/* =======================================================  PLL2_CHK0  ======================================================= */
#define MDR_RST_CLOCK_PLL2_CHK0_PRES_REG3_Pos (0UL)                 /*!< MDR_RST_CLOCK PLL2_CHK0: PRES_REG3 (Bit 0)            */
#define MDR_RST_CLOCK_PLL2_CHK0_PRES_REG3_Msk (0xffffUL)            /*!< MDR_RST_CLOCK PLL2_CHK0: PRES_REG3 (Bitfield-Mask: 0xffff) */
#define MDR_RST_CLOCK_PLL2_CHK0_PRES_REG1_Pos (16UL)                /*!< MDR_RST_CLOCK PLL2_CHK0: PRES_REG1 (Bit 16)           */
#define MDR_RST_CLOCK_PLL2_CHK0_PRES_REG1_Msk (0xffff0000UL)        /*!< MDR_RST_CLOCK PLL2_CHK0: PRES_REG1 (Bitfield-Mask: 0xffff) */
/* =======================================================  PLL2_CHK1  ======================================================= */
#define MDR_RST_CLOCK_PLL2_CHK1_PRES_REG3_Pos (0UL)                 /*!< MDR_RST_CLOCK PLL2_CHK1: PRES_REG3 (Bit 0)            */
