StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE8.h
/* =====================================  MDR_RST_CLOCK HSE0_CLK EN_CHK_EVENT1 [17..17]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE0_CLK_EN_CHK_EVENT1                                      */
  MDR_RST_CLOCK_HSE0_CLK_EN_CHK_EVENT1_Off = 0, /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_HSE0_CLK_EN_CHK_EVENT1_On = 1,  /*!< On : Enable                                                               */
} MDR_RST_CLOCK_HSE0_CLK_EN_CHK_EVENT1_Enum;

/* =====================================  MDR_RST_CLOCK HSE0_CLK EN_CHK_EVENT2 [18..18]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE0_CLK_EN_CHK_EVENT2                                      */
  MDR_RST_CLOCK_HSE0_CLK_EN_CHK_EVENT2_Off = 0, /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_HSE0_CLK_EN_CHK_EVENT2_On = 1,  /*!< On : Enable                                                               */
} MDR_RST_CLOCK_HSE0_CLK_EN_CHK_EVENT2_Enum;

/* =====================================  MDR_RST_CLOCK HSE0_CLK EN_CHK_EVENT3 [19..19]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE0_CLK_EN_CHK_EVENT3                                      */
  MDR_RST_CLOCK_HSE0_CLK_EN_CHK_EVENT3_Off = 0, /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_HSE0_CLK_EN_CHK_EVENT3_On = 1,  /*!< On : Enable                                                               */
} MDR_RST_CLOCK_HSE0_CLK_EN_CHK_EVENT3_Enum;

/* ========================================  MDR_RST_CLOCK HSE0_CLK EN_CHK [20..20]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE0_CLK_EN_CHK                                             */
  MDR_RST_CLOCK_HSE0_CLK_EN_CHK_Off    = 0,     /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_HSE0_CLK_EN_CHK_On     = 1,     /*!< On : Enable                                                               */
} MDR_RST_CLOCK_HSE0_CLK_EN_CHK_Enum;

/* ==================================  MDR_RST_CLOCK HSE0_CLK CLR_CHK_SHIFT_REG0 [21..21]  =================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_SHIFT_REG0                                 */
  MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_SHIFT_REG0_Inactive = 0,/*!< Inactive : No action                                             */
  MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_SHIFT_REG0_Clear = 1,/*!< Clear : Clear level                                                 */
} MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_SHIFT_REG0_Enum;

/* ==================================  MDR_RST_CLOCK HSE0_CLK CLR_CHK_SHIFT_REG1 [22..22]  =================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_SHIFT_REG1                                 */
  MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_SHIFT_REG1_Inactive = 0,/*!< Inactive : No action                                             */
  MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_SHIFT_REG1_Clear = 1,/*!< Clear : Clear level                                                 */
} MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_SHIFT_REG1_Enum;

/* ====================================  MDR_RST_CLOCK HSE0_CLK CLR_CHK_EVENT0 [23..23]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_EVENT0                                     */
  MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_EVENT0_Inactive = 0,/*!< Inactive : No action                                                 */
  MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_EVENT0_Clear = 1,/*!< Clear : Clear level                                                     */
} MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_EVENT0_Enum;

/* ====================================  MDR_RST_CLOCK HSE0_CLK CLR_CHK_EVENT1 [24..24]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_EVENT1                                     */
  MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_EVENT1_Inactive = 0,/*!< Inactive : No action                                                 */
  MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_EVENT1_Clear = 1,/*!< Clear : Clear level                                                     */
} MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_EVENT1_Enum;

/* ====================================  MDR_RST_CLOCK HSE0_CLK CLR_CHK_EVENT2 [25..25]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_EVENT2                                     */
  MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_EVENT2_Inactive = 0,/*!< Inactive : No action                                                 */
  MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_EVENT2_Clear = 1,/*!< Clear : Clear level                                                     */
} MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_EVENT2_Enum;

/* ====================================  MDR_RST_CLOCK HSE0_CLK CLR_CHK_EVENT3 [26..26]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_EVENT3                                     */
  MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_EVENT3_Inactive = 0,/*!< Inactive : No action                                                 */
  MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_EVENT3_Clear = 1,/*!< Clear : Clear level                                                     */
} MDR_RST_CLOCK_HSE0_CLK_CLR_CHK_EVENT3_Enum;

/* ========================================  MDR_RST_CLOCK HSE0_CLK HSE_ON [27..27]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE0_CLK_HSE_ON                                             */
  MDR_RST_CLOCK_HSE0_CLK_HSE_ON_Off    = 0,     /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_HSE0_CLK_HSE_ON_On     = 1,     /*!< On : Enable                                                               */
} MDR_RST_CLOCK_HSE0_CLK_HSE_ON_Enum;

/* ========================================  MDR_RST_CLOCK HSE0_CLK HSE_BYP [28..28]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE0_CLK_HSE_BYP                                            */
  MDR_RST_CLOCK_HSE0_CLK_HSE_BYP_Off   = 0,     /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_HSE0_CLK_HSE_BYP_On    = 1,     /*!< On : Enable                                                               */
} MDR_RST_CLOCK_HSE0_CLK_HSE_BYP_Enum;

