StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE8.h
/* =======================================  MDR_RST_CLOCK HSE0_CLK FILTER_EN [29..29]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE0_CLK_FILTER_EN                                          */
  MDR_RST_CLOCK_HSE0_CLK_FILTER_EN_Off = 0,     /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_HSE0_CLK_FILTER_EN_On  = 1,     /*!< On : Enable                                                               */
} MDR_RST_CLOCK_HSE0_CLK_FILTER_EN_Enum;

/* =======================================================  HSE0_CHK0  ======================================================= */
/* =======================================================  HSE0_CHK1  ======================================================= */
/* =======================================================  HSE0_CHK2  ======================================================= */
/* =======================================================  HSE0_STAT  ======================================================= */
/* ========================================  MDR_RST_CLOCK HSE0_STAT EVENT0 [16..16]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE0_STAT_EVENT0                                            */
  MDR_RST_CLOCK_HSE0_STAT_EVENT0_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_HSE0_STAT_EVENT0_On    = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_HSE0_STAT_EVENT0_Enum;

/* ========================================  MDR_RST_CLOCK HSE0_STAT EVENT1 [17..17]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE0_STAT_EVENT1                                            */
  MDR_RST_CLOCK_HSE0_STAT_EVENT1_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_HSE0_STAT_EVENT1_On    = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_HSE0_STAT_EVENT1_Enum;

/* ========================================  MDR_RST_CLOCK HSE0_STAT EVENT2 [18..18]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE0_STAT_EVENT2                                            */
  MDR_RST_CLOCK_HSE0_STAT_EVENT2_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_HSE0_STAT_EVENT2_On    = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_HSE0_STAT_EVENT2_Enum;

/* ========================================  MDR_RST_CLOCK HSE0_STAT EVENT3 [19..19]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE0_STAT_EVENT3                                            */
  MDR_RST_CLOCK_HSE0_STAT_EVENT3_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_HSE0_STAT_EVENT3_On    = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_HSE0_STAT_EVENT3_Enum;

/* ========================================  MDR_RST_CLOCK HSE0_STAT READY [20..20]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE0_STAT_READY                                             */
  MDR_RST_CLOCK_HSE0_STAT_READY_Off    = 0,     /*!< Off : Clock not Ready                                                     */
  MDR_RST_CLOCK_HSE0_STAT_READY_On     = 1,     /*!< On : Clock Ready                                                          */
} MDR_RST_CLOCK_HSE0_STAT_READY_Enum;

/* =======================================================  HSE1_CLK  ======================================================== */
/* =====================================  MDR_RST_CLOCK HSE1_CLK EN_CHK_EVENT0 [16..16]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE1_CLK_EN_CHK_EVENT0                                      */
  MDR_RST_CLOCK_HSE1_CLK_EN_CHK_EVENT0_Off = 0, /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_HSE1_CLK_EN_CHK_EVENT0_On = 1,  /*!< On : Enable                                                               */
} MDR_RST_CLOCK_HSE1_CLK_EN_CHK_EVENT0_Enum;

/* =====================================  MDR_RST_CLOCK HSE1_CLK EN_CHK_EVENT1 [17..17]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE1_CLK_EN_CHK_EVENT1                                      */
  MDR_RST_CLOCK_HSE1_CLK_EN_CHK_EVENT1_Off = 0, /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_HSE1_CLK_EN_CHK_EVENT1_On = 1,  /*!< On : Enable                                                               */
} MDR_RST_CLOCK_HSE1_CLK_EN_CHK_EVENT1_Enum;

/* =====================================  MDR_RST_CLOCK HSE1_CLK EN_CHK_EVENT2 [18..18]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE1_CLK_EN_CHK_EVENT2                                      */
  MDR_RST_CLOCK_HSE1_CLK_EN_CHK_EVENT2_Off = 0, /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_HSE1_CLK_EN_CHK_EVENT2_On = 1,  /*!< On : Enable                                                               */
} MDR_RST_CLOCK_HSE1_CLK_EN_CHK_EVENT2_Enum;

/* =====================================  MDR_RST_CLOCK HSE1_CLK EN_CHK_EVENT3 [19..19]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE1_CLK_EN_CHK_EVENT3                                      */
  MDR_RST_CLOCK_HSE1_CLK_EN_CHK_EVENT3_Off = 0, /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_HSE1_CLK_EN_CHK_EVENT3_On = 1,  /*!< On : Enable                                                               */
} MDR_RST_CLOCK_HSE1_CLK_EN_CHK_EVENT3_Enum;

/* ========================================  MDR_RST_CLOCK HSE1_CLK EN_CHK [20..20]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE1_CLK_EN_CHK                                             */
  MDR_RST_CLOCK_HSE1_CLK_EN_CHK_Off    = 0,     /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_HSE1_CLK_EN_CHK_On     = 1,     /*!< On : Enable                                                               */
} MDR_RST_CLOCK_HSE1_CLK_EN_CHK_Enum;

/* ==================================  MDR_RST_CLOCK HSE1_CLK CLR_CHK_SHIFT_REG0 [21..21]  =================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE1_CLK_CLR_CHK_SHIFT_REG0                                 */
  MDR_RST_CLOCK_HSE1_CLK_CLR_CHK_SHIFT_REG0_Inactive = 0,/*!< Inactive : No action                                             */
  MDR_RST_CLOCK_HSE1_CLK_CLR_CHK_SHIFT_REG0_Clear = 1,/*!< Clear : Clear level                                                 */
} MDR_RST_CLOCK_HSE1_CLK_CLR_CHK_SHIFT_REG0_Enum;

