StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE8.h
/* ========================================  MDR_RST_CLOCK HSE1_STAT EVENT2 [18..18]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE1_STAT_EVENT2                                            */
  MDR_RST_CLOCK_HSE1_STAT_EVENT2_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_HSE1_STAT_EVENT2_On    = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_HSE1_STAT_EVENT2_Enum;

/* ========================================  MDR_RST_CLOCK HSE1_STAT EVENT3 [19..19]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE1_STAT_EVENT3                                            */
  MDR_RST_CLOCK_HSE1_STAT_EVENT3_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_HSE1_STAT_EVENT3_On    = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_HSE1_STAT_EVENT3_Enum;

/* ========================================  MDR_RST_CLOCK HSE1_STAT READY [20..20]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSE1_STAT_READY                                             */
  MDR_RST_CLOCK_HSE1_STAT_READY_Off    = 0,     /*!< Off : Clock not Ready                                                     */
  MDR_RST_CLOCK_HSE1_STAT_READY_On     = 1,     /*!< On : Clock Ready                                                          */
} MDR_RST_CLOCK_HSE1_STAT_READY_Enum;

/* =======================================================  PLL0_CLK  ======================================================== */
/* ==========================================  MDR_RST_CLOCK PLL0_CLK PLL_Q [0..3]  ========================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL0_CLK_PLL_Q                                              */
  MDR_RST_CLOCK_PLL0_CLK_PLL_Q_div1    = 0,     /*!< div1 : Divider                                                            */
  MDR_RST_CLOCK_PLL0_CLK_PLL_Q_div2    = 1,     /*!< div2 : Divider                                                            */
  MDR_RST_CLOCK_PLL0_CLK_PLL_Q_div3    = 2,     /*!< div3 : Divider                                                            */
  MDR_RST_CLOCK_PLL0_CLK_PLL_Q_div4    = 3,     /*!< div4 : Divider                                                            */
  MDR_RST_CLOCK_PLL0_CLK_PLL_Q_div5    = 4,     /*!< div5 : Divider                                                            */
  MDR_RST_CLOCK_PLL0_CLK_PLL_Q_div6    = 5,     /*!< div6 : Divider                                                            */
  MDR_RST_CLOCK_PLL0_CLK_PLL_Q_div7    = 6,     /*!< div7 : Divider                                                            */
  MDR_RST_CLOCK_PLL0_CLK_PLL_Q_div8    = 7,     /*!< div8 : Divider                                                            */
  MDR_RST_CLOCK_PLL0_CLK_PLL_Q_div9    = 8,     /*!< div9 : Divider                                                            */
  MDR_RST_CLOCK_PLL0_CLK_PLL_Q_div10   = 9,     /*!< div10 : Divider                                                           */
  MDR_RST_CLOCK_PLL0_CLK_PLL_Q_div11   = 10,    /*!< div11 : Divider                                                           */
  MDR_RST_CLOCK_PLL0_CLK_PLL_Q_div12   = 11,    /*!< div12 : Divider                                                           */
  MDR_RST_CLOCK_PLL0_CLK_PLL_Q_div13   = 12,    /*!< div13 : Divider                                                           */
  MDR_RST_CLOCK_PLL0_CLK_PLL_Q_div14   = 13,    /*!< div14 : Divider                                                           */
  MDR_RST_CLOCK_PLL0_CLK_PLL_Q_div15   = 14,    /*!< div15 : Divider                                                           */
  MDR_RST_CLOCK_PLL0_CLK_PLL_Q_div16   = 15,    /*!< div16 : Divider                                                           */
} MDR_RST_CLOCK_PLL0_CLK_PLL_Q_Enum;

/* ===========================================  MDR_RST_CLOCK PLL0_CLK DV [4..4]  ============================================ */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL0_CLK_DV                                                 */
  MDR_RST_CLOCK_PLL0_CLK_DV_div1       = 0,     /*!< div1 : Divider                                                            */
  MDR_RST_CLOCK_PLL0_CLK_DV_div2       = 1,     /*!< div2 : Divider                                                            */
} MDR_RST_CLOCK_PLL0_CLK_DV_Enum;

/* =====================================  MDR_RST_CLOCK PLL0_CLK EN_CHK_EVENT0 [16..16]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT0                                      */
  MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT0_Off = 0, /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT0_On = 1,  /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT0_Enum;

/* =====================================  MDR_RST_CLOCK PLL0_CLK EN_CHK_EVENT1 [17..17]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT1                                      */
  MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT1_Off = 0, /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT1_On = 1,  /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT1_Enum;

/* =====================================  MDR_RST_CLOCK PLL0_CLK EN_CHK_EVENT2 [18..18]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT2                                      */
  MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT2_Off = 0, /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT2_On = 1,  /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT2_Enum;

/* =====================================  MDR_RST_CLOCK PLL0_CLK EN_CHK_EVENT3 [19..19]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT3                                      */
  MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT3_Off = 0, /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT3_On = 1,  /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PLL0_CLK_EN_CHK_EVENT3_Enum;

/* ========================================  MDR_RST_CLOCK PLL0_CLK EN_CHK [20..20]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL0_CLK_EN_CHK                                             */
  MDR_RST_CLOCK_PLL0_CLK_EN_CHK_Off    = 0,     /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PLL0_CLK_EN_CHK_On     = 1,     /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PLL0_CLK_EN_CHK_Enum;

