StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE8.h
/* ====================================  MDR_RST_CLOCK PLL1_CLK CLR_CHK_EVENT3 [26..26]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL1_CLK_CLR_CHK_EVENT3                                     */
  MDR_RST_CLOCK_PLL1_CLK_CLR_CHK_EVENT3_Inactive = 0,/*!< Inactive : No action                                                 */
  MDR_RST_CLOCK_PLL1_CLK_CLR_CHK_EVENT3_Clear = 1,/*!< Clear : Clear level                                                     */
} MDR_RST_CLOCK_PLL1_CLK_CLR_CHK_EVENT3_Enum;

/* ========================================  MDR_RST_CLOCK PLL1_CLK PLL_ON [27..27]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL1_CLK_PLL_ON                                             */
  MDR_RST_CLOCK_PLL1_CLK_PLL_ON_Off    = 0,     /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PLL1_CLK_PLL_ON_On     = 1,     /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PLL1_CLK_PLL_ON_Enum;

/* ========================================  MDR_RST_CLOCK PLL1_CLK PLL_RLD [28..28]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL1_CLK_PLL_RLD                                            */
  MDR_RST_CLOCK_PLL1_CLK_PLL_RLD_Inactive = 0,  /*!< Inactive : Inactive state                                                 */
  MDR_RST_CLOCK_PLL1_CLK_PLL_RLD_Reload = 1,    /*!< Reload : Reload PLL                                                       */
} MDR_RST_CLOCK_PLL1_CLK_PLL_RLD_Enum;

/* ========================================  MDR_RST_CLOCK PLL1_CLK SELECT [29..31]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL1_CLK_SELECT                                             */
  MDR_RST_CLOCK_PLL1_CLK_SELECT_HSI    = 0,     /*!< HSI : HSI signal                                                          */
  MDR_RST_CLOCK_PLL1_CLK_SELECT_HSI_div2 = 1,   /*!< HSI_div2 : HSI/2 signal                                                   */
  MDR_RST_CLOCK_PLL1_CLK_SELECT_HSE0   = 2,     /*!< HSE0 : HSE0 signal                                                        */
  MDR_RST_CLOCK_PLL1_CLK_SELECT_HSE0_div2 = 3,  /*!< HSE0_div2 : HSE0/2 signal                                                 */
  MDR_RST_CLOCK_PLL1_CLK_SELECT_HSE1   = 4,     /*!< HSE1 : HSE1 signal                                                        */
  MDR_RST_CLOCK_PLL1_CLK_SELECT_HSE1_div2 = 5,  /*!< HSE1_div2 : HSE1/2 signal                                                 */
} MDR_RST_CLOCK_PLL1_CLK_SELECT_Enum;

/* =======================================================  PLL1_CHK0  ======================================================= */
/* =======================================================  PLL1_CHK1  ======================================================= */
/* =======================================================  PLL1_CHK2  ======================================================= */
/* =======================================================  PLL1_STAT  ======================================================= */
/* ========================================  MDR_RST_CLOCK PLL1_STAT EVENT0 [16..16]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL1_STAT_EVENT0                                            */
  MDR_RST_CLOCK_PLL1_STAT_EVENT0_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_PLL1_STAT_EVENT0_On    = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_PLL1_STAT_EVENT0_Enum;

/* ========================================  MDR_RST_CLOCK PLL1_STAT EVENT1 [17..17]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL1_STAT_EVENT1                                            */
  MDR_RST_CLOCK_PLL1_STAT_EVENT1_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_PLL1_STAT_EVENT1_On    = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_PLL1_STAT_EVENT1_Enum;

/* ========================================  MDR_RST_CLOCK PLL1_STAT EVENT2 [18..18]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL1_STAT_EVENT2                                            */
  MDR_RST_CLOCK_PLL1_STAT_EVENT2_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_PLL1_STAT_EVENT2_On    = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_PLL1_STAT_EVENT2_Enum;

/* ========================================  MDR_RST_CLOCK PLL1_STAT EVENT3 [19..19]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL1_STAT_EVENT3                                            */
  MDR_RST_CLOCK_PLL1_STAT_EVENT3_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_PLL1_STAT_EVENT3_On    = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_PLL1_STAT_EVENT3_Enum;

/* ========================================  MDR_RST_CLOCK PLL1_STAT READY [20..20]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL1_STAT_READY                                             */
  MDR_RST_CLOCK_PLL1_STAT_READY_Off    = 0,     /*!< Off : Clock not Ready                                                     */
  MDR_RST_CLOCK_PLL1_STAT_READY_On     = 1,     /*!< On : Clock Ready                                                          */
} MDR_RST_CLOCK_PLL1_STAT_READY_Enum;

/* =======================================================  PLL2_CLK  ======================================================== */
/* ==========================================  MDR_RST_CLOCK PLL2_CLK PLL_Q [0..3]  ========================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_CLK_PLL_Q                                              */
  MDR_RST_CLOCK_PLL2_CLK_PLL_Q_div1    = 0,     /*!< div1 : Divider                                                            */
  MDR_RST_CLOCK_PLL2_CLK_PLL_Q_div2    = 1,     /*!< div2 : Divider                                                            */
  MDR_RST_CLOCK_PLL2_CLK_PLL_Q_div3    = 2,     /*!< div3 : Divider                                                            */
  MDR_RST_CLOCK_PLL2_CLK_PLL_Q_div4    = 3,     /*!< div4 : Divider                                                            */
  MDR_RST_CLOCK_PLL2_CLK_PLL_Q_div5    = 4,     /*!< div5 : Divider                                                            */
  MDR_RST_CLOCK_PLL2_CLK_PLL_Q_div6    = 5,     /*!< div6 : Divider                                                            */
  MDR_RST_CLOCK_PLL2_CLK_PLL_Q_div7    = 6,     /*!< div7 : Divider                                                            */
  MDR_RST_CLOCK_PLL2_CLK_PLL_Q_div8    = 7,     /*!< div8 : Divider                                                            */
  MDR_RST_CLOCK_PLL2_CLK_PLL_Q_div9    = 8,     /*!< div9 : Divider                                                            */
  MDR_RST_CLOCK_PLL2_CLK_PLL_Q_div10   = 9,     /*!< div10 : Divider                                                           */
  MDR_RST_CLOCK_PLL2_CLK_PLL_Q_div11   = 10,    /*!< div11 : Divider                                                           */
  MDR_RST_CLOCK_PLL2_CLK_PLL_Q_div12   = 11,    /*!< div12 : Divider                                                           */
  MDR_RST_CLOCK_PLL2_CLK_PLL_Q_div13   = 12,    /*!< div13 : Divider                                                           */
  MDR_RST_CLOCK_PLL2_CLK_PLL_Q_div14   = 13,    /*!< div14 : Divider                                                           */
  MDR_RST_CLOCK_PLL2_CLK_PLL_Q_div15   = 14,    /*!< div15 : Divider                                                           */
  MDR_RST_CLOCK_PLL2_CLK_PLL_Q_div16   = 15,    /*!< div16 : Divider                                                           */
} MDR_RST_CLOCK_PLL2_CLK_PLL_Q_Enum;

/* ===========================================  MDR_RST_CLOCK PLL2_CLK DV [4..4]  ============================================ */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_CLK_DV                                                 */
  MDR_RST_CLOCK_PLL2_CLK_DV_div1       = 0,     /*!< div1 : Divider                                                            */
  MDR_RST_CLOCK_PLL2_CLK_DV_div2       = 1,     /*!< div2 : Divider                                                            */
} MDR_RST_CLOCK_PLL2_CLK_DV_Enum;

/* =====================================  MDR_RST_CLOCK PLL2_CLK EN_CHK_EVENT0 [16..16]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT0                                      */
  MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT0_Off = 0, /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT0_On = 1,  /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT0_Enum;

/* =====================================  MDR_RST_CLOCK PLL2_CLK EN_CHK_EVENT1 [17..17]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT1                                      */
  MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT1_Off = 0, /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT1_On = 1,  /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT1_Enum;

